{
  "meal_plans": [
    {
      "category": "Normal Weight",
      "recipes": [
        {
          "name": "Mukimo",
          "weight_class": "Normal",
          "ingredients": [
            "2 cups maize (corn) kernels",
            "2 cups green peas",
            "2 cups pumpkin leaves (sukuma wiki), chopped",
            "2 cups potatoes, peeled and cubed",
            "1 medium onion, chopped",
            "2 tomatoes, diced",
            "2 tablespoons vegetable oil",
            "Salt to taste"
          ],
          "instructions": [
            "In a large pot, boil the maize kernels, green peas, and potatoes until tender.",
            "Drain the boiled ingredients and set aside.",
            "In a separate pan, heat the vegetable oil and sauté the onions until translucent.",
            "Add the tomatoes and cook until they soften.",
            "Add the pumpkin leaves (sukuma wiki) and cook until wilted.",
            "Mash the boiled maize, green peas, and potatoes together until well combined.",
            "Add the sautéed mixture to the mashed ingredients and mix well.",
            "Season with salt to taste.",
            "Serve hot as a side dish with your preferred main course."
          ]
        },
        {
          "name": "Chapati",
          "weight_class": "Normal",
          "ingredients": [
            "2 cups all-purpose flour",
            "1 cup water",
            "1 tablespoon vegetable oil",
            "1/2 teaspoon salt"
          ],
          "instructions": [
            "In a large mixing bowl, combine the flour and salt.",
            "Gradually add water and knead until you form a smooth dough.",
            "Add the vegetable oil and continue kneading for a few more minutes.",
            "Divide the dough into small equal-sized balls.",
            "On a floured surface, roll out each ball into a thin, round shape.",
            "Heat a non-stick pan or skillet over medium heat.",
            "Cook each rolled-out dough for about 1-2 minutes on each side or until lightly browned.",
            "Remove from the pan and repeat the process with the remaining dough balls.",
            "Serve hot with your favorite curry or stew."
          ]
        },
        {
          "name": "Nyama Choma",
          "weight_class": "Normal",
          "ingredients": [
            "2 lbs beef or goat meat, cut into chunks",
            "1 tablespoon vegetable oil",
            "1 teaspoon salt",
            "1 teaspoon black pepper",
            "1 teaspoon paprika",
            "1 teaspoon garlic powder",
            "1 teaspoon ginger powder",
            "Juice of 1 lemon"
          ],
          "instructions": [
            "In a large bowl, combine the salt, black pepper, paprika, garlic powder, ginger powder, and lemon juice to make a marinade.",
            "Add the meat chunks to the marinade and coat them well.",
            "Cover the bowl and refrigerate for at least 2 hours or overnight for the flavors to develop.",
            "Preheat the grill to medium-high heat.",
            "Remove the meat from the marinade and thread it onto skewers.",
            "Brush the grill grates with vegetable oil to prevent sticking.",
            "Grill the meat skewers for about 10-15 minutes, turning occasionally, until cooked to your desired doneness.",
            "Serve the Nyama Choma hot with a side of Kachumbari (Kenyan tomato and onion salad)."
          ]
        }
      ]
    },
    {
      "category": "Underweight",
      "recipes": [
        {
          "name": "Sukuma Wiki with Ugali",
          "weight_class": "Underweight",
          "ingredients": [
            "1 bunch sukuma wiki (collard greens), chopped",
            "2 tablespoons vegetable oil",
            "1 onion, finely chopped",
            "2 tomatoes, diced",
            "2 cloves garlic, minced",
            "Salt to taste",
            "2 cups maize flour",
            "4 cups water"
          ],
          "instructions": [
            "In a large pan, heat the vegetable oil over medium heat.",
            "Add the chopped onion and minced garlic to the pan and sauté until golden brown.",
            "Add the diced tomatoes and cook until they soften.",
            "Add the chopped sukuma wiki to the pan and stir-fry for about 5 minutes or until wilted.",
            "Season with salt to taste.",
            "In a separate pot, bring the water to a boil.",
            "Slowly add the maize flour to the boiling water, stirring continuously to avoid lumps.",
            "Reduce the heat to low and continue stirring until the mixture thickens into a stiff consistency.",
            "Cover the pot and let the ugali cook for about 10-15 minutes, stirring occasionally.",
            "Serve the cooked sukuma wiki with ugali on the side."
          ]
        },
        {
          "name": "Kenyan Masala Tea",
          "weight_class": "Underweight",
          "ingredients": [
            "2 cups water",
            "2 cups milk",
            "2 teaspoons black tea leaves",
            "2 tablespoons sugar (adjust to taste)",
            "2-3 cardamom pods, crushed",
            "2-3 cloves",
            "1 cinnamon stick"
          ],
          "instructions": [
            "In a saucepan, bring the water to a boil.",
            "Add the crushed cardamom pods, cloves, and cinnamon stick to the boiling water.",
            "Reduce the heat to low and simmer for a few minutes to infuse the flavors.",
            "Add the black tea leaves to the pan and simmer for another 2-3 minutes.",
            "Pour in the milk and sugar, and stir well.",
            "Bring the mixture to a gentle simmer and let it cook for an additional 3-4 minutes.",
            "Remove from heat and strain the tea into cups.",
            "Serve the Kenyan Masala Tea hot and enjoy!"
          ]
        }
      ]
    },
    {
      "category": "Overweight",
      "recipes": [
        {
          "name": "Grilled Tilapia with Spicy Peanut Sauce",
          "weight_class": "Overweight",
          "ingredients": [
            "2 tilapia fillets",
            "2 tablespoons peanut butter",
            "1 tablespoon soy sauce",
            "1 tablespoon honey",
            "1 tablespoon lime juice",
            "1 teaspoon grated ginger",
            "1 teaspoon minced garlic",
            "1 teaspoon chili flakes (adjust to taste)",
            "Salt and pepper to taste",
            "2 tablespoons vegetable oil"
          ],
          "instructions": [
            "Preheat the grill to medium-high heat.",
            "In a bowl, whisk together the peanut butter, soy sauce, honey, lime juice, grated ginger, minced garlic, chili flakes, salt, and pepper to make the spicy peanut sauce.",
            "Brush the tilapia fillets with vegetable oil and season with salt and pepper.",
            "Grill the tilapia fillets for about 3-4 minutes per side or until cooked through and slightly charred.",
            "Serve the grilled tilapia with the spicy peanut sauce drizzled on top. Enjoy with steamed vegetables or rice!"
          ]
        },
        {
          "name": "Low-Carb Stuffed Bell Peppers",
          "weight_class": "Overweight",
          "ingredients": [
            "4 bell peppers",
            "1 pound lean ground turkey",
            "1 cup cauliflower rice",
            "1/2 cup diced tomatoes",
            "1/2 cup diced onions",
            "1/4 cup shredded cheddar cheese",
            "2 tablespoons tomato paste",
            "1 tablespoon olive oil",
            "1 teaspoon garlic powder",
            "Salt and pepper to taste"
          ],
          "instructions": [
            "Preheat the oven to 400°F (200°C).",
            "Cut off the tops of the bell peppers and remove the seeds and membranes.",
            "In a large skillet, heat the olive oil over medium heat.",
            "Add the onions and ground turkey to the skillet. Cook until the turkey is browned and onions are soft.",
            "Stir in the cauliflower rice, diced tomatoes, tomato paste, garlic powder, salt, and pepper. Cook for an additional 5 minutes.",
            "Fill the bell peppers with the turkey mixture and place them in a baking dish.",
            "Cover the dish with foil and bake in the preheated oven for 25-30 minutes or until the bell peppers are tender.",
            "Remove the foil, sprinkle the shredded cheddar cheese over the peppers, and bake for an additional 5 minutes or until the cheese is melted and bubbly.",
            "Serve the low-carb stuffed bell peppers as a delicious and healthy meal."
          ]
        }
      ]
    },
    {
      "category": "Obese",
      "recipes": [
        {
          "name": "Vegetable Stir-Fry",
          "weight_class": "Obese",
          "ingredients": [
            "2 cups mixed vegetables (broccoli, bell peppers, carrots, snow peas, etc.), chopped",
            "1 onion, thinly sliced",
            "2 cloves garlic, minced",
            "1 tablespoon soy sauce",
            "1 tablespoon hoisin sauce",
            "1 teaspoon sesame oil",
            "1 tablespoon vegetable oil",
            "Salt and pepper to taste"
          ],
          "instructions": [
            "Heat the vegetable oil in a wok or large skillet over high heat.",
            "Add the sliced onions and minced garlic to the pan. Stir-fry for a minute until fragrant.",
            "Add the mixed vegetables to the pan and stir-fry for about 3-4 minutes until they are tender-crisp.",
            "In a small bowl, whisk together the soy sauce, hoisin sauce, sesame oil, salt, and pepper.",
            "Pour the sauce over the vegetables and stir-fry for an additional 1-2 minutes to coat the vegetables evenly.",
            "Remove from heat and serve the vegetable stir-fry as a flavorful and healthy meal. Enjoy with steamed rice or noodles if desired."
          ]
        },
        {
          "name": "Grilled Chicken Salad",
          "weight_class": "Obese",
          "ingredients": [
            "2 cups mixed salad greens",
            "1 grilled chicken breast, sliced",
            "1/2 cup cherry tomatoes, halved",
            "1/4 cup cucumber slices",
            "1/4 cup sliced red onions",
            "2 tablespoons olive oil",
            "1 tablespoon balsamic vinegar",
            "Salt and pepper to taste"
          ],
          "instructions": [
            "In a large bowl, combine the mixed salad greens, sliced grilled chicken breast, cherry tomatoes, cucumber slices, and red onions.",
            "In a small bowl, whisk together the olive oil, balsamic vinegar, salt, and pepper to make the dressing.",
            "Drizzle the dressing over the salad and tossto coat the ingredients evenly.",
            "Serve the grilled chicken salad as a satisfying and nutritious meal option."
          ]
        }
      ]
    }
  ],
  "users": [
    {
      "id": 1,
      "name": "kim",
      "weight": "30",
      "height": "1.4",
      "bmi": 15.306122448979593
    }
  ]
}